Rust.org
#+TITLE: RUST
#+OPTIONS: num:t
#+startup: content
#+EXPORT_FILE_NAME: /home/si/Dropbox/LiteraturPrograme/html/Rust.html
#+PROPERTY: header-args :eval no-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
* array and slienc
数组类型表示为[T; N]，数组的引用类型表示为&[T;N]，Slice类型表示为[T]，Slice的引用类型表示为&[T]。
* str String &[] Vec convert
|---------+---------+--------------------------------------------------|
| s       | to      | function                                         |
| &str    | String  | String::from(s) or s.to_string() or s.to_owned() |
| &str    | &[u8]   | s.as_bytes()                                     |
| &str    | Vec<u8> | s.as_bytes().to_vec()                            |
| String  | &[u8]   | s.as_bytes()                                     |
| String  | &str    | s.as_str() or &s                                |
| String  | Vec<u8> | s.into_bytes()                                   |
| &[u8]   | &str    | std::str::from_utf8(s).unwrap()                  |
| &[u8]   | String  | String::from_utf8(s).unwrap()                    |
| &[u8]   | Vec<u8> | s.to_vec()                                       |
| Vec<u8> | &str    | std::str::from_utf8(&s).unwrap()                 |
| Vec<u8> | String  | String::from_utf8(s).unwrap()                    |
| Vec<u8> | &[u8]   | &s or s.as_slice()                              |
|---------+---------+--------------------------------------------------|

* 所有权
#+begin_src rust :results output
  fn main() {
      let s1 = String::from("hello");
      let s2 = s1;

      println!("{}, world!", s2);
      // println!("{}, world!", s1);  

  }

#+end_src

#+RESULTS:
: hello, world!

#+begin_src rust :results  output
  fn main() {
      let s = String::from("hello world");

      let word = first_word(s);

      //      s.clear(); // error!

      println!("the first word is: {}", word);
  }
  fn first_word(s: String) -> String {
      s
  }


#+end_src

#+RESULTS:
: the first word is: hello world


#+begin_src rust :results output
  fn main() {
      #[derive(Debug)]
      struct User {
          active: bool,
          username: String,
          email: String,
          sign_in_count: u64,
      }

      let user1 = User {
          email: String::from("someone@example.com"),
          username: String::from("someusername123"),
          active: true,
          sign_in_count: 1,
      };
      // let user2 = User {
      //     email: String::from("another@example.com"),
      //     ..user1
      // };

      let user2 = User {
          active: user1.active,
          username: String::from("uset2"),
          email: String::from("another@example.com"),
          sign_in_count: user1.sign_in_count,
      };

      println!("{}", user1.email);
      // 下面这行会报错
      println!("{:?}", user2)

  }



#+end_src

#+RESULTS:
: someone@example.com
: User { active: true, username: "uset2", email: "another@example.com", sign_in_count: 1 }

- HITS:
  no matter  with   ..user1 or  xxx: user1.xxx to create new user with old user, if only  fundemantal  elements have been copy, the old user can still be available, and the other  non-fundemantal attributes also . Otherwise the old user instance and also the non-fundemantal attributes are both not available.

