html/Rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-07 Mo 12:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RUST</title>
<meta name="author" content="si" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">RUST</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ec6cf7">1. array and slienc</a></li>
<li><a href="#org68a3c5e">2. str String &amp;[] Vec convert</a></li>
<li><a href="#orgeee92bc">3. 所有权</a></li>
<li><a href="#orgc3df001">4. test</a></li>
<li><a href="#orgb311608">5. item collections</a></li>
<li><a href="#orgab7cf32">6. 特征对象</a></li>
<li><a href="#orgfda46e0">7. mut</a>
<ul>
<li><a href="#org7563934">7.1. mut example</a></li>
<li><a href="#orgf665101">7.2. different lifetime</a></li>
</ul>
</li>
<li><a href="#org8a307c1">8. Traits with where</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3ec6cf7" class="outline-2">
<h2 id="org3ec6cf7"><span class="section-number-2">1.</span> array and slienc</h2>
<div class="outline-text-2" id="text-1">
<p>
数组类型表示为[T; N]，数组的引用类型表示为&amp;[T;N]，Slice类型表示为[T]，Slice的引用类型表示为&amp;[T]。
</p>
</div>
</div>
<div id="outline-container-org68a3c5e" class="outline-2">
<h2 id="org68a3c5e"><span class="section-number-2">2.</span> str String &amp;[] Vec convert</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">s</td>
<td class="org-left">to</td>
<td class="org-left">function</td>
</tr>

<tr>
<td class="org-left">&amp;str</td>
<td class="org-left">String</td>
<td class="org-left">String::from(s) or s.to<sub>string</sub>() or s.to<sub>owned</sub>()</td>
</tr>

<tr>
<td class="org-left">&amp;str</td>
<td class="org-left">&amp;[u8]</td>
<td class="org-left">s.as<sub>bytes</sub>()</td>
</tr>

<tr>
<td class="org-left">&amp;str</td>
<td class="org-left">Vec&lt;u8&gt;</td>
<td class="org-left">s.as<sub>bytes</sub>().to<sub>vec</sub>()</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">&amp;[u8]</td>
<td class="org-left">s.as<sub>bytes</sub>()</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">&amp;str</td>
<td class="org-left">s.as<sub>str</sub>() or &amp;s</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">Vec&lt;u8&gt;</td>
<td class="org-left">s.into<sub>bytes</sub>()</td>
</tr>

<tr>
<td class="org-left">&amp;[u8]</td>
<td class="org-left">&amp;str</td>
<td class="org-left">std::str::from<sub>utf8</sub>(s).unwrap()</td>
</tr>

<tr>
<td class="org-left">&amp;[u8]</td>
<td class="org-left">String</td>
<td class="org-left">String::from<sub>utf8</sub>(s).unwrap()</td>
</tr>

<tr>
<td class="org-left">&amp;[u8]</td>
<td class="org-left">Vec&lt;u8&gt;</td>
<td class="org-left">s.to<sub>vec</sub>()</td>
</tr>

<tr>
<td class="org-left">Vec&lt;u8&gt;</td>
<td class="org-left">&amp;str</td>
<td class="org-left">std::str::from<sub>utf8</sub>(&amp;s).unwrap()</td>
</tr>

<tr>
<td class="org-left">Vec&lt;u8&gt;</td>
<td class="org-left">String</td>
<td class="org-left">String::from<sub>utf8</sub>(s).unwrap()</td>
</tr>

<tr>
<td class="org-left">Vec&lt;u8&gt;</td>
<td class="org-left">&amp;[u8]</td>
<td class="org-left">&amp;s or s.as<sub>slice</sub>()</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgeee92bc" class="outline-2">
<h2 id="orgeee92bc"><span class="section-number-2">3.</span> 所有权</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">s1</span> = <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"hello"</span>);
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">s2</span> = s1;

    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">, world!"</span>, s2);
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">println!("{}, world!", s1);  </span>

}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">s</span> = <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"hello world"</span>);

    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">word</span> = first_word(s);

    <span style="color: #2aa1ae; background-color: #292e34;">//      </span><span style="color: #2aa1ae; background-color: #292e34;">s.clear(); // error!</span>

    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"the first word is: </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">"</span>, word);
}
<span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">first_word</span>(<span style="color: #7590db;">s</span>: <span style="color: #ce537a; font-weight: bold;">String</span>) -&gt; <span style="color: #ce537a; font-weight: bold;">String</span> {
    s
}


</pre>
</div>


<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #bc6ec5;">#[derive(Debug)]</span>
    <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">User</span> {
        <span style="color: #7590db;">active</span>: <span style="color: #ce537a; font-weight: bold;">bool</span>,
        <span style="color: #7590db;">username</span>: <span style="color: #ce537a; font-weight: bold;">String</span>,
        <span style="color: #7590db;">email</span>: <span style="color: #ce537a; font-weight: bold;">String</span>,
        <span style="color: #7590db;">sign_in_count</span>: <span style="color: #ce537a; font-weight: bold;">u64</span>,
    }

    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">user1</span> = <span style="color: #ce537a; font-weight: bold;">User</span> {
        <span style="color: #7590db;">email</span>: <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"someone@example.com"</span>),
        <span style="color: #7590db;">username</span>: <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"someusername123"</span>),
        <span style="color: #7590db;">active</span>: <span style="color: #4f97d7; font-weight: bold;">true</span>,
        <span style="color: #7590db;">sign_in_count</span>: 1,
    };
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">let user2 = User {</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">email: String::from("another@example.com"),</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">..user1</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">};</span>

    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">user2</span> = <span style="color: #ce537a; font-weight: bold;">User</span> {
        <span style="color: #7590db;">active</span>: user1.active,
        <span style="color: #7590db;">username</span>: <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"uset2"</span>),
        <span style="color: #7590db;">email</span>: <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"another@example.com"</span>),
        <span style="color: #7590db;">sign_in_count</span>: user1.sign_in_count,
    };

    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">"</span>, user1.email);
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#36825;&#34892;&#20250;&#25253;&#38169;</span>
    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-style: italic;">{:?}</span><span style="color: #2d9574;">"</span>, user2)

}



</pre>
</div>

<ul class="org-ul">
<li>HITS:
no matter  with   ..user1 or  xxx: user1.xxx to create new user with old user, if only  fundemantal  elements have been copy, the old user can still be available, and the other  non-fundemantal attributes also . Otherwise the old user instance and also the non-fundemantal attributes are both not available.</li>
</ul>
</div>
</div>
