html/Rust.html
<div id="outline-container-orgc3df001" class="outline-2">
<h2 id="orgc3df001"><span class="section-number-2">4.</span> test</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">greetings</span> = [<span style="color: #2d9574;">"Hello"</span>, <span style="color: #2d9574;">"Hola"</span>, <span style="color: #2d9574;">"Bonjour"</span>,
                     <span style="color: #2d9574;">"Ciao"</span>, <span style="color: #2d9574;">"&#12371;&#12435;&#12395;&#12385;&#12399;"</span>, <span style="color: #2d9574;">"&#50504;&#45397;&#54616;&#49464;&#50836;"</span>,
                     <span style="color: #2d9574;">"Cze&#347;&#263;"</span>, <span style="color: #2d9574;">"Ol&#225;"</span>, <span style="color: #2d9574;">"&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;"</span>,
                     <span style="color: #2d9574;">"ch&#224;o b&#7841;n"</span>, <span style="color: #2d9574;">"&#24744;&#22909;"</span>];

    <span style="color: #4f97d7; font-weight: bold;">for</span> (num, greeting) <span style="color: #4f97d7; font-weight: bold;">in</span> greetings.iter().enumerate() {
        <span style="color: #4f97d7;">print!</span>(<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;"> : "</span>, greeting);
        <span style="color: #4f97d7; font-weight: bold;">match</span> num {
            0 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"This code is editable and runnable!"</span>),
            1 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Este c&#243;digo es editable y ejecutable!"</span>),
            2 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Ce code est modifiable et ex&#233;cutable!"</span>),
            3 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Questo codice &#232; modificabile ed eseguibile!"</span>),
            4 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"&#12371;&#12398;&#12467;&#12540;&#12489;&#12399;&#32232;&#38598;&#12375;&#12390;&#23455;&#34892;&#20986;&#26469;&#12414;&#12377;&#65281;"</span>),
            5 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"&#50668;&#44592;&#50640;&#49436; &#53076;&#46300;&#47484; &#49688;&#51221;&#54616;&#44256; &#49892;&#54665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;!"</span>),
            6 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Ten kod mo&#380;na edytowa&#263; oraz uruchomi&#263;!"</span>),
            7 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Esse c&#243;digo &#233; edit&#225;vel e execut&#225;vel!"</span>),
            8 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"&#1069;&#1090;&#1086;&#1090; &#1082;&#1086;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;!"</span>),
            9 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"B&#7841;n c&#243; th&#7875; edit v&#224; run code tr&#7921;c ti&#7871;p!"</span>),
            10 =&gt;  <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"&#36825;&#27573;&#20195;&#30721;&#26159;&#21487;&#20197;&#32534;&#36753;&#24182;&#19988;&#33021;&#22815;&#36816;&#34892;&#30340;&#65281;"</span>),
            _ =&gt;  {},
        }
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb311608" class="outline-2">
<h2 id="orgb311608"><span class="section-number-2">5.</span> item collections</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">impl</span> <span style="color: #ce537a; font-weight: bold;">Summary</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #ce537a; font-weight: bold;">Post</span>    

</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">notify</span>&lt;<span style="color: #7590db;">T</span>: <span style="color: #ce537a; font-weight: bold;">Summary</span>&gt;(<span style="color: #7590db;">item</span>: <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #ce537a; font-weight: bold;">T</span>) {
    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Breaking news! </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">"</span>, item.summarize());
}
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">is like</span>
<span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">notify</span>(<span style="color: #7590db;">item</span>: <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">impl</span> <span style="color: #ce537a; font-weight: bold;">Summary</span>) {
    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"Breaking news! </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">"</span>, item.summarize());
}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #bc6ec5;">#[derive(Debug)]</span>
<span style="color: #4f97d7; font-weight: bold;">enum</span> <span style="color: #ce537a; font-weight: bold;">UiObject</span> {
    <span style="color: #ce537a; font-weight: bold;">Button</span>,
    <span style="color: #ce537a; font-weight: bold;">SelectBox</span>,
}

<span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">objects</span> = [
        <span style="color: #ce537a; font-weight: bold;">UiObject</span>::<span style="color: #ce537a; font-weight: bold;">Button</span>,
        <span style="color: #ce537a; font-weight: bold;">UiObject</span>::<span style="color: #ce537a; font-weight: bold;">SelectBox</span>
    ];

    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">o</span> <span style="color: #4f97d7; font-weight: bold;">in</span> objects {
        draw(o)
    }
}

<span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">draw</span>(<span style="color: #7590db;">o</span>: <span style="color: #ce537a; font-weight: bold;">UiObject</span>) {
    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-style: italic;">{:?}</span><span style="color: #2d9574;">"</span>,o);
}
</pre>
</div>
</div>
</div>
