Rust.org
* 特征对象
#+begin_src rust :results output
  pub trait Draw {
      fn draw(&self);
  }

  pub struct Button {
      pub width: u32,
      pub height: u32,
      pub label: String,
  }

  impl Draw for Button {
      fn draw(&self) {
          // 绘制按钮的代码
          println!("draw for Button, {}, {}, {}", &self.width, &self.height, &self.label);
      }
  }

  struct SelectBox {
      width: u32,
      height: u32,
      options: Vec<String>,
  }

  impl Draw for SelectBox {
      fn draw(&self) {
          // 绘制SelectBox的代码
          println!("draw for Selectbox {}, {}, {:?}", &self.width, &self.height, &self.options);
      }
  }


  // pub struct Screen {
  //     pub components: Vec<Box<dyn Draw>>,
  // }
  // impl Screen {
  //     pub fn run(&self) {
  //         for component in self.components.iter() {
  //             component.draw();
  //         }
  //     }
  // }

  pub struct Screen<T: Draw> {
      pub components: Vec<T>,
  }

  impl<T> Screen <T>
  where T: Draw {
      pub fn run(&self) {
          for component in self.components.iter() {
              component.draw();
          }
      }
  }




  fn main() {
      let screen = Screen {
          components: vec![
              Box::new(SelectBox {
                  width: 75,
                  height: 10,
                  options: vec![
                      String::from("Yes"),
                      String::from("Maybe"),
                      String::from("No")
                  ],
              }),
              Box::new(Button {
                  width: 50,
                  height: 10,
                  label: String::from("OK"),
              }),
          ],
      };

      screen.run();
  }

#+end_src

#+RESULTS:

* mut
** mut example
#+begin_src rust :results output
  fnmain() {
      let x :i32 = 48;
      let X :i32 = 480;
      let mut y :&i32        = &x;    // y can be redirected from x to X, but y can not change x
      let      z: &mut &i32 = &mut y  // z can not be redirected, but z can change y
  }

#+end_src
** different lifetime
#+begin_src rust :results output
  fn main() {
      struct MutStr<'a, 'b> {
          s: &'a mut &'b str,
      }

      let mut r: &str = "hello";
      Mutstr{s: &mut r}.s = "world";
      println!("{}", r);
  }

#+end_src

#+RESULTS:
