html/Rust.html
<div id="outline-container-orgab7cf32" class="outline-2">
<h2 id="orgab7cf32"><span class="section-number-2">6.</span> 特征对象</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">trait</span> <span style="color: #ce537a; font-weight: bold;">Draw</span> {
    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">draw</span>(<span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>);
}

<span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Button</span> {
    <span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #7590db;">width</span>: <span style="color: #ce537a; font-weight: bold;">u32</span>,
    <span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #7590db;">height</span>: <span style="color: #ce537a; font-weight: bold;">u32</span>,
    <span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #7590db;">label</span>: <span style="color: #ce537a; font-weight: bold;">String</span>,
}

<span style="color: #4f97d7; font-weight: bold;">impl</span> <span style="color: #ce537a; font-weight: bold;">Draw</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #ce537a; font-weight: bold;">Button</span> {
    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">draw</span>(<span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>) {
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#32472;&#21046;&#25353;&#38062;&#30340;&#20195;&#30721;</span>
        <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"draw for Button, </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">, </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">, </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">"</span>, <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>.width, <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>.height, <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>.label);
    }
}

<span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">SelectBox</span> {
    <span style="color: #7590db;">width</span>: <span style="color: #ce537a; font-weight: bold;">u32</span>,
    <span style="color: #7590db;">height</span>: <span style="color: #ce537a; font-weight: bold;">u32</span>,
    <span style="color: #7590db;">options</span>: <span style="color: #ce537a; font-weight: bold;">Vec</span>&lt;<span style="color: #ce537a; font-weight: bold;">String</span>&gt;,
}

<span style="color: #4f97d7; font-weight: bold;">impl</span> <span style="color: #ce537a; font-weight: bold;">Draw</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #ce537a; font-weight: bold;">SelectBox</span> {
    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">draw</span>(<span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>) {
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#32472;&#21046;SelectBox&#30340;&#20195;&#30721;</span>
        <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"draw for Selectbox </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">, </span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">, </span><span style="color: #2d9574; font-style: italic;">{:?}</span><span style="color: #2d9574;">"</span>, <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>.width, <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>.height, <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>.options);
    }
}


<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">pub struct Screen {</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">pub components: Vec&lt;Box&lt;dyn Draw&gt;&gt;,</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">impl Screen {</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">pub fn run(&amp;self) {</span>
<span style="color: #2aa1ae; background-color: #292e34;">//         </span><span style="color: #2aa1ae; background-color: #292e34;">for component in self.components.iter() {</span>
<span style="color: #2aa1ae; background-color: #292e34;">//             </span><span style="color: #2aa1ae; background-color: #292e34;">component.draw();</span>
<span style="color: #2aa1ae; background-color: #292e34;">//         </span><span style="color: #2aa1ae; background-color: #292e34;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">}</span>

<span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Screen</span>&lt;<span style="color: #7590db;">T</span>: <span style="color: #ce537a; font-weight: bold;">Draw</span>&gt; {
    <span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #7590db;">components</span>: <span style="color: #ce537a; font-weight: bold;">Vec</span>&lt;<span style="color: #ce537a; font-weight: bold;">T</span>&gt;,
}

<span style="color: #4f97d7; font-weight: bold;">impl</span>&lt;<span style="color: #ce537a; font-weight: bold;">T</span>&gt; <span style="color: #ce537a; font-weight: bold;">Screen</span> &lt;<span style="color: #ce537a; font-weight: bold;">T</span>&gt;
<span style="color: #4f97d7; font-weight: bold;">where</span> <span style="color: #7590db;">T</span>: <span style="color: #ce537a; font-weight: bold;">Draw</span> {
    <span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">self</span>) {
        <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">component</span> <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.components.iter() {
            component.draw();
        }
    }
}




<span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">screen</span> = <span style="color: #ce537a; font-weight: bold;">Screen</span> {
        <span style="color: #7590db;">components</span>: <span style="color: #bc6ec5;">vec!</span>[
            <span style="color: #ce537a; font-weight: bold;">Box</span>::new(<span style="color: #ce537a; font-weight: bold;">SelectBox</span> {
                <span style="color: #7590db;">width</span>: 75,
                <span style="color: #7590db;">height</span>: 10,
                <span style="color: #7590db;">options</span>: <span style="color: #bc6ec5;">vec!</span>[
                    <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"Yes"</span>),
                    <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"Maybe"</span>),
                    <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"No"</span>)
                ],
            }),
            <span style="color: #ce537a; font-weight: bold;">Box</span>::new(<span style="color: #ce537a; font-weight: bold;">Button</span> {
                <span style="color: #7590db;">width</span>: 50,
                <span style="color: #7590db;">height</span>: 10,
                <span style="color: #7590db;">label</span>: <span style="color: #ce537a; font-weight: bold;">String</span>::from(<span style="color: #2d9574;">"OK"</span>),
            }),
        ],
    };

    screen.run();
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgfda46e0" class="outline-2">
<h2 id="orgfda46e0"><span class="section-number-2">7.</span> mut</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org7563934" class="outline-3">
<h3 id="org7563934"><span class="section-number-3">7.1.</span> mut example</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-rust">fnmain() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">x</span> :<span style="color: #ce537a; font-weight: bold;">i32</span> = 48;
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">X</span> :<span style="color: #ce537a; font-weight: bold;">i32</span> = 480;
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #7590db;">y</span> :<span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #ce537a; font-weight: bold;">i32</span>        = <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span>x;    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">y can be redirected from x to X, but y can not change x</span>
    <span style="color: #4f97d7; font-weight: bold;">let</span>      <span style="color: #7590db;">z</span>: <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #ce537a; font-weight: bold;">i32</span> = <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">mut</span> y  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">z can not be redirected, but z can change y</span>
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf665101" class="outline-3">
<h3 id="orgf665101"><span class="section-number-3">7.2.</span> different lifetime</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">MutStr</span>&lt;'<span style="color: #7590db;">a</span>, '<span style="color: #7590db;">b</span>&gt; {
        <span style="color: #7590db;">s</span>: <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span>'<span style="color: #7590db;">a</span> <span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span>'<span style="color: #7590db;">b</span> <span style="color: #ce537a; font-weight: bold;">str</span>,
    }

    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #7590db;">r</span>: <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #ce537a; font-weight: bold;">str</span> = <span style="color: #2d9574;">"hello"</span>;
    <span style="color: #ce537a; font-weight: bold;">Mutstr</span>{<span style="color: #7590db;">s</span>: <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">mut</span> r}.s = <span style="color: #2d9574;">"world"</span>;
    <span style="color: #4f97d7;">println!</span>(<span style="color: #2d9574;">"</span><span style="color: #2d9574; font-style: italic;">{}</span><span style="color: #2d9574;">"</span>, r);
}

</pre>
</div>
</div>
</div>
</div>
