Rust.org
* Traits with where
#+begin_src rust :exports both :results output
  struct Cacher<T, E>
  where
      T: Fn(E) -> E,
      E: Copy,
  {
      query: T,
      value: Option<E>,
  }

  impl<T, E> Cacher<T, E>
  where
      T: Fn(E) -> E,
      E: Copy,
  {
      fn new(query: T) -> Cacher<T, E> {
          Cacher { query, value: None }
      }

      fn value(&mut self, arg: E) -> E {
          match self.value {
              Some(v) => v,
              None => {
                  let v = (self.query)(arg);
                  self.value = Some(v);
                  v
              }
          }
      }
  }

  #[cfg(test)]
  mod tests {
      use super::*;
      
      #[test]
      fn call_with_different_values() {
          let mut c = Cacher::new(|a| a);
          c.value(1);

          let v1 = c.value(1);
          let v2 = c.value(2);

          assert_eq!(v2, 1);
          assert_eq!(v2, v1);
      }

      #[test]
      fn call_with_str() {
          let mut b = Cacher::new(|a| a);
          let b1 = b.value("test");

          assert_eq!("test", b1);
      }
      pub fn run_tests_manually() {
          call_with_different_values();
          call_with_str();
      }
  }
  fn main() {
      let mut c = Cacher::new(|a| a+2);
      c.value(1);
      let v1 = c.value(1);
      assert_eq!(v1, 3);
      
      #[cfg(test)]
      tests::run_tests_manually();
  }
#+end_src

#+RESULTS:
