html/Rust.html
<div id="outline-container-org8a307c1" class="outline-2">
<h2 id="org8a307c1"><span class="section-number-2">8.</span> Traits with where</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Cacher</span>&lt;<span style="color: #ce537a; font-weight: bold;">T</span>, <span style="color: #ce537a; font-weight: bold;">E</span>&gt;
<span style="color: #4f97d7; font-weight: bold;">where</span>
    <span style="color: #7590db;">T</span>: <span style="color: #ce537a; font-weight: bold;">Fn</span>(<span style="color: #ce537a; font-weight: bold;">E</span>) -&gt; <span style="color: #ce537a; font-weight: bold;">E</span>,
    <span style="color: #7590db;">E</span>: <span style="color: #ce537a; font-weight: bold;">Copy</span>,
{
    <span style="color: #7590db;">query</span>: <span style="color: #ce537a; font-weight: bold;">T</span>,
    <span style="color: #7590db;">value</span>: <span style="color: #ce537a; font-weight: bold;">Option</span>&lt;<span style="color: #ce537a; font-weight: bold;">E</span>&gt;,
}

<span style="color: #4f97d7; font-weight: bold;">impl</span>&lt;<span style="color: #ce537a; font-weight: bold;">T</span>, <span style="color: #ce537a; font-weight: bold;">E</span>&gt; <span style="color: #ce537a; font-weight: bold;">Cacher</span>&lt;<span style="color: #ce537a; font-weight: bold;">T</span>, <span style="color: #ce537a; font-weight: bold;">E</span>&gt;
<span style="color: #4f97d7; font-weight: bold;">where</span>
    <span style="color: #7590db;">T</span>: <span style="color: #ce537a; font-weight: bold;">Fn</span>(<span style="color: #ce537a; font-weight: bold;">E</span>) -&gt; <span style="color: #ce537a; font-weight: bold;">E</span>,
    <span style="color: #7590db;">E</span>: <span style="color: #ce537a; font-weight: bold;">Copy</span>,
{
    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">new</span>(<span style="color: #7590db;">query</span>: <span style="color: #ce537a; font-weight: bold;">T</span>) -&gt; <span style="color: #ce537a; font-weight: bold;">Cacher</span>&lt;<span style="color: #ce537a; font-weight: bold;">T</span>, <span style="color: #ce537a; font-weight: bold;">E</span>&gt; {
        <span style="color: #ce537a; font-weight: bold;">Cacher</span> { query, <span style="color: #7590db;">value</span>: <span style="color: #ce537a; font-weight: bold;">None</span> }
    }

    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">value</span>(<span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #4f97d7; font-weight: bold;">self</span>, <span style="color: #7590db;">arg</span>: <span style="color: #ce537a; font-weight: bold;">E</span>) -&gt; <span style="color: #ce537a; font-weight: bold;">E</span> {
        <span style="color: #4f97d7; font-weight: bold;">match</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.value {
            <span style="color: #ce537a; font-weight: bold;">Some</span>(v) =&gt; v,
            <span style="color: #ce537a; font-weight: bold;">None</span> =&gt; {
                <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">v</span> = (<span style="color: #4f97d7; font-weight: bold;">self</span>.query)(arg);
                <span style="color: #4f97d7; font-weight: bold;">self</span>.value = <span style="color: #ce537a; font-weight: bold;">Some</span>(v);
                v
            }
        }
    }
}

<span style="color: #bc6ec5;">#[cfg(test)]</span>
<span style="color: #4f97d7; font-weight: bold;">mod</span> <span style="color: #a45bad;">tests</span> {
    <span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #4f97d7; font-weight: bold;">super</span>::*;

    <span style="color: #bc6ec5;">#[test]</span>
    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">call_with_different_values</span>() {
        <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #7590db;">c</span> = <span style="color: #ce537a; font-weight: bold;">Cacher</span>::new(|a| a);
        c.value(1);

        <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">v1</span> = c.value(1);
        <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">v2</span> = c.value(2);

        <span style="color: #bc6ec5;">assert_eq!</span>(v2, 1);
        <span style="color: #bc6ec5;">assert_eq!</span>(v2, v1);
    }

    <span style="color: #bc6ec5;">#[test]</span>
    <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">call_with_str</span>() {
        <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #7590db;">b</span> = <span style="color: #ce537a; font-weight: bold;">Cacher</span>::new(|a| a);
        <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">b1</span> = b.value(<span style="color: #2d9574;">"test"</span>);

        <span style="color: #bc6ec5;">assert_eq!</span>(<span style="color: #2d9574;">"test"</span>, b1);
    }
    <span style="color: #4f97d7; font-weight: bold;">pub</span> <span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">run_tests_manually</span>() {
        call_with_different_values();
        call_with_str();
    }
}
<span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #4f97d7; font-weight: bold;">mut</span> <span style="color: #7590db;">c</span> = <span style="color: #ce537a; font-weight: bold;">Cacher</span>::new(|a| a+2);
    c.value(1);
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">v1</span> = c.value(1);
    <span style="color: #bc6ec5;">assert_eq!</span>(v1, 3);

    <span style="color: #bc6ec5;">#[cfg(test)]</span>
    <span style="color: #a45bad;">tests</span>::run_tests_manually();
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: si</p>
<p class="date">Created: 2025-04-07 Mo 12:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
